# -*- coding: utf-8 -*-

# ————————————————————————————————————————
# 测试环境：
MYSQL = {
    'host': '192.168.2.60',
    'port': 3306,
    'user': 'luomm',
    'password': 'DJ360disoK',
    'db': 'das-job',
}

DB_MONGO = {
    'host': '192.168.4.103',
    'port': 27017,
    'user': 'admin',
    'password': 'fxtxq1205',
    'db': 'DataCollecting',
}

REDIS = {
    'host': '192.168.4.26',
    'port': 6379,
    'password': '',
    'db': 4
}

# ————————————————————————————————
# 生产环境：
# MYSQL = {
#     'host': '192.168.4.99',
#     'port': 3306,
#     'user': 'root',
#     'password': 'Admin_123',
#     'db': 'das_job_prod',
# }
#
# DB_MONGO = {
#     'host': '192.168.4.90',
#     'port': 27017,
#     'user': 'app_xiqu',
#     'password': 'eQ5fy5tIKxBg9vp07E9q',
#     'db': 'DataCollecting',
# }
# REDIS = {
#     'host': '192.168.4.102',
#     'port': 6379,
#     'password': 123456,
#     'db': 1
# }
# ————————————————————————————————

SPLIT_TABLE_NUM = 50

DB_MONGO_SLAVE = {
    'host': '192.168.4.90',
    'port': 27017,
    'user': 'app_xiqu',
    'password': 'eQ5fy5tIKxBg9vp07E9q',
    'db': 'DataCollecting',
}


# 是否自动入库到FDC
IS_AUTO_FDC = False

FDC_API_UPLOAD_URL = 'http://192.168.2.108:8060/case/anonymity/import'

EXPORT_FILE_DIR = '/mnt/daq/files/'
# EXPORT_FILE_DIR = '/home/xiquadmin/files/'

PAGE_SIZE = 1000

# 缓存超时时间
CACHE_EX_TIME = 1800

EMAIL = {
    'host': 'smtp.mxhichina.com',
    'port': 465,
    'username': 'daq@fxtcn.com',
    'password': 'daq@fxt123',
    'receivers': 'gongf@fxtcn.com' # ,yuanhl@fxtcn.com
}

LOG_PATH = '/var/log/renting-std/'
LOG_LEVEL = 'DEBUG'

ASTER = '*'

# 城市区域缓存key值约定
CITY_PRE = 'city_'
AREA_PRE = 'area_'
CITY_ALIAS_PRE = 'city_alias_'
AREA_ALIAS_PRE = 'area_alias_'
CITY_PATTERN = CITY_PRE + ASTER
AREA_PATTERN = AREA_PRE + ASTER

# sys_code类型
CODE_TS = {'户型结构': 2005, '建筑类型': 2003, '居住用途': 1002, '朝向': 2004, '装修档次': 6026}

#
CODE_PRE = 'code_'
CODE_PATTERN = CODE_PRE + ASTER

JOBS = [
        {  # 第一个任务
            'id': 'job1',
            'func': 'app.webapi.statis_case_email_api:send_email',
            'args': '',
            'trigger': 'cron',  # cron表示定时任务
            'hour': 1,
            'minute': 0,
            'second': 0
        },
        # {  # 第二个任务，每隔5S执行一次
        #     'id': 'job2',
        #     'func': '__main__:send_email', # 方法名
        #     'args': (1,2), # 入参
        #     'trigger': 'interval', # interval表示循环任务
        #     'seconds': 5,
        # }
    ]

province_dict = {'北京市': ['北京市', ], '深圳市': ['深圳市', ], '上海市': ['上海市', ], '广州市': ['广州市', ], '天津市': ['天津市', ],
                     '重庆市': ['重庆市', ],
                     '广东省': ["珠海市", "肇庆市", "梅州市", "中山市", "云浮市", "佛山市", "韶关市", "揭阳市", "江门市", "湛江市", "东莞市", "河源市", "潮州市",
                             "惠州市", "汕头市", "汕尾市", "清远市", "阳江市", "茂名市", ],
                     '江苏省': ["扬州市", "宿迁市", "无锡市", "淮安市", "苏州市", "泰州市", "南京市", "南通市", "徐州市", "连云港市", "镇江市", "盐城市", "宜兴市",
                             "常州市", ],
                     '浙江省': ["嘉兴市", "宁波市", "台州市", "衢州市", "舟山市", "杭州市", "金华市", "绍兴市", "湖州市", "丽水市", "温州市", ],
                     '山东省': ["泰安市", "济南市", "菏泽市", "德州市", "威海市", "日照市", "枣庄市", "东营市", "烟台市", "临沂市", "莱芜市", "淄博市", "青岛市",
                             "济宁市", "潍坊市", "聊城市", "滨州市", ],
                     '河南省': ["平顶山市", "三门峡市", "漯河市", "信阳市", "鹤壁市", "开封市", "濮阳市", "商丘市", "济源市", "周口市", "安阳市", "南阳市",
                             "郑州市", "驻马店市", "许昌市", "洛阳市", "新乡市", "焦作市", ],
                     '四川省': ["甘孜藏族自治州", "内江市", "成都市", "乐山市", "雅安市", "泸州市", "达州市", "绵阳市", "自贡市", "广元市", "遂宁市", "德阳市",
                             "巴中市", "眉山市", "资阳市", "广安市", "攀枝花市", "南充市", "阿坝藏族羌族自治州", "凉山彝族自治州", "宜宾市", ],
                     '湖北省': ["黄冈市", "襄阳市", "神农架林区", "鄂州市", "恩施土家族苗族自治州", "咸宁市", "武汉市", "潜江市", "孝感市", "十堰市", "天门市",
                             "宜昌市", "仙桃市", "荆门市", "黄石市", "随州市", "荆州市", ],
                     '湖南省': ["怀化市", "衡阳市", "湘西土家族苗族自治州", "株洲市", "长沙市", "邵阳市", "益阳市", "张家界市", "常德市", "湘潭市", "娄底市", "岳阳市",
                             "永州市", "郴州市", ],
                     '福建省': ["三明市", "福州市", "龙岩市", "漳州市", "莆田市", "泉州市", "宁德市", "厦门市", "南平市", ],
                     '河北省': ["秦皇岛市", "承德市", "石家庄市", "沧州市", "张家口市", "邢台市", "廊坊市", "保定市", "衡水市", "唐山市", "邯郸市", ],
                     '安徽省': ["合肥市", "宿州市", "芜湖市", "蚌埠市", "淮南市", "淮北市", "六安市", "马鞍山市", "安庆市", "宣城市", "黄山市", "池州市", "滁州市",
                             "铜陵市", "阜阳市", "亳州市", ],
                     '辽宁省': ["营口市", "盘锦市", "沈阳市", "朝阳市", "抚顺市", "葫芦岛市", "大连市", "本溪市", "铁岭市", "锦州市", "阜新市", "辽阳市", "鞍山市",
                             "丹东市", ],
                     '陕西省': ["铜川市", "榆林市", "西安市", "商洛市", "延安市", "宝鸡市", "咸阳市", "渭南市", "安康市", "汉中市", ],
                     '江西省': ["九江市", "南昌市", "宜春市", "抚州市", "赣州市", "新余市", "吉安市", "上饶市", "景德镇市", "鹰潭市", "萍乡市", ],
                     '广西省': ["玉林市", "来宾市", "南宁市", "北海市", "百色市", "河池市", "梧州市", "贵港市", "钦州市", "贺州市", "柳州市", "崇左市", "桂林市",
                             "防城港市", ],
                     '云南省': ["德宏傣族景颇族自治州", "昭通市", "怒江傈僳族自治州", "曲靖市", "大理白族自治州", "玉溪市", "丽江市", "临沧市", "保山市", "楚雄彝族自治州",
                             "文山壮族苗族自治州", "红河哈尼族彝族自治州", "昆明市", "迪庆藏族自治州", "普洱市", "西双版纳傣族自治州", ],
                     '山西省': ["临汾市", "忻州市", "大同市", "晋中市", "朔州市", "太原市", "晋城市", "运城市", "吕梁市", "长治市", "阳泉市", ],
                     '黑龙江省': ["鹤岗市", "绥化市", "牡丹江市", "大兴安岭地区", "双鸭山市", "佳木斯市", "鸡西市", "大庆市", "齐齐哈尔市", "哈尔滨市", "黑河市",
                              "伊春市", "七台河市", ],
                     '吉林省': ["吉林市", "通化市", "白山市", "敦化市", "松原市", "白城市", "四平市", "长春市", "延边朝鲜族自治州", "辽源市", ],
                     '贵州省': ["贵阳市", "六盘水市", "黔西南布依族苗族自治州", "毕节市", "铜仁市", "黔南布依族苗族自治州", "安顺市", "遵义市", "黔东南苗族侗族自治州", ],
                     '甘肃省': ["嘉峪关市", "天水市", "临夏回族自治州", "甘南藏族自治州", "庆阳市", "兰州市", "酒泉市", "张掖市", "定西市", "平凉市", "金昌市",
                             "武威市", "白银市", "陇南市", "临夏市", "甘南市", ],
                     '海南省': ["五指山市", "昌江黎族自治县", "西沙群岛", "三亚市", "临高县", "陵水黎族自治县", "万宁市", "屯昌县", "西南中沙群岛办事处（县级）", "三沙市",
                             "海口市", "儋州市", "琼中黎族苗族自治县", "琼海市", "定安县", "乐东黎族自治县", "南沙群岛", "东方市", "白沙黎族自治县", "中沙群岛岛礁及海域",
                             "文昌市", "澄迈县", "保亭黎族苗族自治县", ],
                     '西藏省': ["林芝地区", "山南地区", "拉萨市", "日喀则市", "昌都地区", "那曲地区", "阿里地区", ],
                     '新疆省': ["博尔塔拉蒙古自治州", "五家渠市", "铁门关市", "乌鲁木齐市", "阿拉尔市", "和田地区", "伊犁哈萨克自治州", "北屯市", "塔城地区", "阿克苏地区",
                             "哈密地区", "吐鲁番地区", "克拉玛依市", "巴音郭楞蒙古自治州", "石河子市", "昌吉回族自治州", "图木舒克市", "喀什地区", "阿勒泰地区",
                             "克孜勒苏柯尔克孜自治州", ],
                     '青海省': ["海南藏族自治州", "玉树藏族自治州", "海东市", "黄南藏族自治州", "海北藏族自治州", "西宁市", "海西蒙古族藏族自治州", "果洛藏族自治州", ],
                     '宁夏省': ["固原市", "中卫市", "吴忠市", "银川市", "石嘴山市", ],
                     '内蒙古': ["乌海市", "包头市", "赤峰市", "兴安盟", "通辽市", "呼和浩特市", "锡林郭勒盟", "巴彦淖尔市", "鄂尔多斯市", "乌兰察布市", "阿拉善盟",
                             "呼伦贝尔市", ]}